{
  "HEADER": {
    "ABOUT_ME": "About me",
    "SKILLS": "Skills",
    "PROJECTS": "Projects",
    "HOME": "Home"
  },

  "ABOVE": {
    "DEVELOPER": "Frontend Developer",
    "CHECK": "Check my work",
    "CONTACT": "Contact me",
    "MARQUEE": {
      "AVAILABLE_REMOTE": "Available for remote work",
      "FRONTEND_DEV": "Frontend Developer",
      "BASED_IN": "Based in Munich",
      "OPEN_TO_WORK": "Open to work"
    }
  },

  "ABOUT": {
    "WHO": "Who I Am",
    "ABOUT": "About me",
    "ME": "Hi, I’m Daniel! I’ve been working in web development for over three and a half years, starting with my apprenticeship. I’m passionate about combining the logic of computer science with the creativity of design, building websites and applications that are not only functional but also visually engaging.",
    "LOCATION": "I’m based in Munich, but I thrive in flexible environments. Remote work fits me perfectly, and I’m open to relocating for the right opportunity.",
    "UP_2_DATE": "I approach new technologies, tools, and frameworks with curiosity and enthusiasm. For me, learning isn’t just about keeping up it’s a chance to innovate, bring fresh ideas to my work, and continually push the boundaries of what I can create.",
    "COGNITION": "I tackle challenges with a mix of analytical thinking, creativity, and persistence. I love experimenting to find elegant, efficient solutions that have a meaningful impact. Coding for me is more than getting things done it’s about crafting solutions that last."
  },

  "SKILLS": {
    "TECH": "Technologies",
    "SET": "Skill Set",
    "INFO": "I’ve worked with a wide range of front-end and back-end technologies, including Angular, TypeScript, Firebase, Docker, Java, PHP, and SQL. I adapt quickly to new technologies, continuously refine my skills and workflow, and treat every project as an opportunity to learn, grow, and stay ahead in the fast-moving world of web development, delivering efficient, scalable, and engaging solutions.",
    "ANOTHER": "You need",
    "SKILL": "another skill?",
    "CONTACT": "Feel free to contact me. I look forward to expanding on my previous knowledge.",
    "TALK": "Let's Talk",
    "INTERESTS": "I have a special interest in learning",
    "MINDSET": "Growth mindset"
  },

  "PORTFOLIO" : {
    "FEATURED": "Featured Projects",
    "EXPLORE": "Explore a selection of my work here - Interact with <br> projects to see my skills in action.",
    "ARIA": "View details of",
    "DIALOG": {
      "ABOUT": "What is this project about?",
      "PREVIOUS": "Previous",
      "NEXT": "Next"
    },
    "PROJECTS": {
      "POK_DEX_DESC": "JavaScript-based project with a connection to the RESTful Pokémon API.",
      "JOIN_DESC": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
      "SHARKIE_DESC": "Underwater platformer based on object-oriented approach. Help Sharkie to find coins and bubbles to fight against the killer whale.",
      "DA_BUBBLE_DESC": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuitive interface, real-time messaging, and robust channel organization."
    }
  },

  "COLLEAGUES": {
    "SAY": "What my colleagues say about me",
    "COL_1": "L. Hamacher - Full Stack Developer",
    "COL_1_TEXT": "Working with him was a great experience. He is highly knowledgeable, quick to learn, and a true team player. I would gladly collaborate with him again.",
    "COL_2": "Philip - IT Specialist in Application Development",
    "COL_2_TEXT": "He was a year younger in the program, and I had the opportunity to teach him various skills. He was eager to learn, quickly absorbed new knowledge, and approached every task with curiosity and enthusiasm.",
    "COL_3": "F. Yilmaz - Senior SEO Manager",
    "COL_3_TEXT": "I identified him as a promising candidate for our Apprenticeship. During our time together, he showed great enthusiasm and dedication, eagerly learning SEO from me and quickly applying his new skills. His curiosity and motivation made him truly stand out.",
    "COL_4": "A. Petrović - Software Developer",
    "COL_4_TEXT": "I first met him during his internship at my workplace and immediately recognized his potential in software development. I supported him in finding a suitable apprenticeship position, and he consistently demonstrated motivation, curiosity, and a strong willingness to learn.",
    "COL_5": "Markus - Frontend Developer Mentor",
    "COL_5_TEXT": "I had the pleasure of mentoring him in frontend development during his apprenticeship. While work responsibilities eventually limited my teaching time, I was consistently impressed by his dedication, curiosity, and ability to learn quickly. I would have loved to continue guiding him, as he showed great potential and enthusiasm."
  },

  "CONTACT": {
    "CONTACT": "Contact me",
    "TOGETHER": "Let's work together",
    "PROBLEM": "Got a problem to solve?",
    "INFO": "I build websites and applications that are functional, engaging, and user-friendly. I’m open to remote work and collaborations, bringing technical expertise, creativity, and curiosity to every project.",
    "IN_NEED": "Need a frontend developer?",
    "TALK": "Let’s talk;",
    "VALUE": "I’d love to add real value to your team or idea!",
    "YOUR_NAME": "What's your name?",
    "NAME_PLACEHOLDER": "Your name goes here",
    "NAME_ERROR": "Oops! it seems your name is missing",
    "YOUR_EMAIL": "What's your email?",
    "EMAIL_PLACEHOLDER": "youremail@email.com",
    "EMAIL_ERROR": "Hoppla! your email is required",
    "MESSAGE": "How can I help you?",
    "MESSAGE_PLACEHOLDER": "Hello Daniel, I am interested in...",
    "MESSAGE_ERROR": "What do you need to develop?",
    "MESSAGE_SENT": "Your message has been sent. <br> I’ll get back to you within 24 hours.",
    "MESSAGE_THX": "Thanks,",
    "CHECKBOX_1": "I've read the",
    "CHECKBOX_2": "and agree to the processing of my data as outlined.",
    "PRIVACY_POLICY": "privacy policy",
    "TERMS_ERROR": "Please accept the privacy policy.",
    "SAY": "Say Hello ;)"
  },

  "PRIVACY": {
    "TITLE": "Privacy Policy",
    "H3_INTRODUCTION": "Introduction",
    "INTRODUCTION": "I respect your privacy and take the protection of your personal data seriously. This Privacy Policy explains how I handle information when you visit and use <span class='highlight'>Portfolio</span> (my personal website).",
    "H3_INFO_COLLECT": "Information I collect",
    "INFO_COLLECT": "I do not actively collect, process, or store personal data of visitors. However, certain technical information (such as IP address, browser type, and general usage data) may be automatically collected by your browser or my hosting provider to ensure the basic functionality and security of the website.",
    "H3_USE_INFO": "Use of information",
    "USE_INFO": "Any automatically collected information is used solely to maintain and improve the performance, functionality, and security of <span class='highlight'>Portfolio</span>. I do not use your data for marketing, profiling, or commercial purposes.",
    "H3_COOKIES": "Cookies",
    "COOKIES": "<span class='highlight'>Portfolio</span> itself does not use cookies. However, third-party services or the hosting provider may rely on cookies for technical operation. You can manage or block cookies at any time via your browser settings.",
    "H3_THIRD_PARTY": "Third-party services",
    "THIRD_PARTY": "This website may contain links to external websites. I am not responsible for the privacy practices or content of those external services. Visiting such sites is at your own discretion.",
    "H3_DATA_SECURITY": "Data security",
    "DATA_SECURITY": "I take reasonable measures to protect your information. However, as with any online service, I cannot guarantee complete protection against all risks. Please use this website with that understanding.",
    "H3_YOUR_RIGHTS": "Your rights",
    "YOUR_RIGHTS": "As a visitor, you have the right to request information about any personal data that may have been collected, as well as to request its correction or deletion where applicable. Since <span class='highlight'>Portfolio</span> does not intentionally store personal data, such requests may be limited in scope.",
    "H3_CHANGES": "Changes to this Privacy Policy",
    "CHANGES": "I may update this Privacy Policy from time to time to reflect changes in legal requirements or technical setup. Updates will be published on this page.",
    "H3_CONTACT": "Contact",
    "CONTACT": "For any questions regarding this Privacy Policy, please contact me at <a href='mailto:webmaster@daniel-tran.com'>webmaster@daniel-tran.com</a>.",
    "DATE": "Date: July 26, 2025"
  },

  "LEGAL_NOTICE": {
    "TITLE": "Legal Notice",
    "H3_IMPRINT": "Imprint",
    "IMPRINT": "<ul><li>Daniel Tran</li><li>Wellenkampstraße 15</li><li>80933 München</li></ul>",
    "H3_EXPLORING": "Exploring the Board",
    "EXPLORING": "Email: <a href='mailto:webmaster@daniel-tran.com'>webmaster@daniel-tran.com</a>",
    "H3_ACCEPTANCE": "Acceptance of terms",
    "ACCEPTANCE": "By accessing and using <span class='highlight'>Portfolio</span> (Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. I may update or change the terms and conditions from time to time without notice.",
    "H3_SCOPE": "Scope and ownership of the product",
    "SCOPE": "<span class='highlight'>Portfolio</span> has been developed as part of a student project in a web development bootcamp at the <span class='highlight'>Developer Akademie GmbH</span>.",
    "SCOPE_2": "The design of <span class='highlight'>Portfolio</span> is owned by the <span class='highlight'>Developer Akademie GmbH</span>. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
    "H3_PROPRIETARY": "Proprietary rights",
    "PROPRIETARY": "Aside from the design owned by <span class='highlight'>Developer Akademie GmbH</span>, I retain all proprietary rights in <span class='highlight'>Portfolio</span>, including any associated <a href='#'>copyrighted material, trademarks, and other proprietary information</a>.",
    "H3_USE": "Use of the product",
    "USE": "<span class='highlight'>Portfolio</span> is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of <span class='highlight'>Portfolio</span> for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of <span class='highlight'>Portfolio</span>.",
    "H3_DISCLAIMER": "Disclaimer of warranties and limitation of liability",
    "DISCLAIMER": "<span class='highlight'>Portfolio</span> is provided 'as is' without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will I or the Developer Akademie, be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of <span class='highlight'>Portfolio</span>.",
    "H3_INDEMNITY": "Indemnity",
    "INDEMNITY": "You agree to indemnify, defend and hold harmless us, Me and the Developer Akademie, and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of <span class='highlight'>Portfolio</span> and/or your breach of this Legal Notice.",
    "CONTACT": "For any questions or notices, please contact us at <a href='mailto:webmaster@daniel-tran.com'>webmaster@daniel-tran.com</a>.",
    "DATE": "Date: July 26, 2025"
  },

  "FOOTER": {
    "DEVELOPER": "Web Developer",
    "ADDRESS": "Munich Germany",
    "LEGAL_NOTICE": "Legal Notice"
  }
}
